In [41]:
import pandas as pd
import os

path = 'names'  #путь к файлам

In [42]:
def top3(years):
    extention = '.txt'
    df_list = list()
    for year in years:
        year = str(year)
        filename = 'yob'+ year + extention
        filepath = os.path.join(path, filename)
        df = pd.read_csv(filepath, names=['Name', 'Gender', 'Count'])
        df['Year'] = year
        df_list.append(df)
    df_concat = pd.concat(df_list)
    df_group = df_concat.groupby(['Name']).sum()
    df_res = df_group.sort_values(by='Count', ascending=False)
    return df_res[:3]

In [43]:
top3([1880])

         Count
Name
John      9701
William   9562
Mary      7092